public_html/homepage_docker.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Homepage Docker</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Homepage Docker</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7d48a2e">1. Info</a></li>
<li><a href="#orga221320">2. Uso</a></li>
<li><a href="#org036ce34">3. Enlace</a></li>
<li><a href="#org1026b9c">4. Variables de entorno</a></li>
<li><a href="#orgc4a9b9e">5. docker-compose.yml</a></li>
<li><a href="#org9fdc5d2">6. Gestión</a></li>
<li><a href="#orgbabc3a0">7. Notas</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7d48a2e" class="outline-2">
<h2 id="org7d48a2e"><span class="section-number-2">1.</span> Info</h2>
<div class="outline-text-2" id="text-1">
<p>
Homepage es un panel de inicio y dashboard altamente personalizable para tu infraestructura y servicios auto-alojados. Es una aplicación web rápida, segura y totalmente estática, configurable mediante archivos YAML o etiquetas Docker, y con soporte para más de 100 integraciones de servicios y widgets como tiempo, reloj y estado de contenedores. Permite agrupar enlaces y servicios en un solo lugar, mostrar estado y métricas, y extenderse con widgets personalizados. Su integración con Docker y Kubernetes facilita la detección automática de servicios y su monitorización. Está diseñado para ser usado detrás de un proxy seguro o VPN.
</p>
</div>
</div>
<div id="outline-container-orga221320" class="outline-2">
<h2 id="orga221320"><span class="section-number-2">2.</span> Uso</h2>
<div class="outline-text-2" id="text-2">
<p>
Mi página de inicio de servicios autoalojados
</p>
</div>
</div>

<div id="outline-container-org036ce34" class="outline-2">
<h2 id="org036ce34"><span class="section-number-2">3.</span> Enlace</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://gethomepage.dev">https://gethomepage.dev</a>
<a href="http://homepage.zgz.sherblog.es">http://homepage.zgz.sherblog.es</a>
</p>
</div>
</div>

<div id="outline-container-org1026b9c" class="outline-2">
<h2 id="org1026b9c"><span class="section-number-2">4.</span> Variables de entorno</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>HOMEPAGE<sub>ALLOWED</sub><sub>HOSTS</sub>: Separados por comas los host en los que está corriendo</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4a9b9e" class="outline-2">
<h2 id="orgc4a9b9e"><span class="section-number-2">5.</span> docker-compose.yml</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #cae682;">services</span>:
  <span style="color: #cae682;">homepage</span>:
    <span style="color: #cae682;">user</span>: <span style="color: #95e454;">"1000:1000"</span>
    <span style="color: #cae682;">image</span>: ghcr.io/gethomepage/homepage:latest
    <span style="color: #cae682;">container_name</span>: homepage
    <span style="color: #cae682;">ports</span>:
      - 4000:3000
    <span style="color: #cae682;">volumes</span>:
      - /home/sherlockes/dockers/homepage/data:/app/config
      - /home/sherlockes/dockers/homepage/data/icons:/app/public/icons
      - /var/run/docker.sock:/var/run/docker.sock <span style="color: #99968b;"># </span><span style="color: #99968b;">(optional) For docker integrations
</span>    <span style="color: #cae682;">restart</span>: unless-stopped
    <span style="color: #cae682;">environment</span>:
      <span style="color: #cae682;">HOMEPAGE_ALLOWED_HOSTS</span>: homepage.zgz.sherblog.es,192.168.10.211:4000
<span style="color: #cae682;">networks</span>: {}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9fdc5d2" class="outline-2">
<h2 id="org9fdc5d2"><span class="section-number-2">6.</span> Gestión</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-bash">docker compose up -d
docker compose logs -f 
docker compose restart 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbabc3a0" class="outline-2">
<h2 id="orgbabc3a0"><span class="section-number-2">7.</span> Notas</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Favoritos: bookmarks.yaml</li>
<li>Servicios: services.yaml</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-01-04</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
